-- phpMyAdmin SQL Dump
-- version 4.9.5deb2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Апр 22 2022 г., 16:41
-- Версия сервера: 8.0.27-0ubuntu0.20.04.1
-- Версия PHP: 7.4.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `kruiz`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cruis`
--

CREATE TABLE `cruis` (
  `id` int NOT NULL,
  `ship_id` int NOT NULL DEFAULT '0',
  `kr_inner_id` text NOT NULL,
  `provider_id` int NOT NULL,
  `deleted` int NOT NULL,
  `status_seazon_discount` int NOT NULL DEFAULT '1' COMMENT 'раннее бронирование',
  `alias` int NOT NULL DEFAULT '0',
  `pagetitle` text NOT NULL,
  `kr_name` text NOT NULL,
  `kr_date_start` date NOT NULL,
  `kr_date_end` date NOT NULL,
  `kr_nights` int NOT NULL,
  `kr_days` int NOT NULL,
  `kr_weekend` int NOT NULL,
  `kr_cities` text NOT NULL,
  `kr_route` text NOT NULL,
  `route_full` text NOT NULL,
  `route_start` varchar(255) NOT NULL,
  `route_end` varchar(255) NOT NULL,
  `kr_url` text NOT NULL,
  `kr_route_name` text NOT NULL,
  `kr_region` text NOT NULL,
  `kr_river` text NOT NULL,
  `kr_surchage_meal_rub` text NOT NULL,
  `kr_surcharge_excursions_rub` text NOT NULL,
  `deleted_date` int NOT NULL,
  `dt_start` datetime DEFAULT NULL,
  `dt_end` datetime DEFAULT NULL,
  `whiteswan_id` int NOT NULL,
  `excursions` text,
  `min_price` int NOT NULL,
  `max_price` int NOT NULL,
  `free_places1_left` int NOT NULL,
  `free_places2_left` int NOT NULL,
  `free_places3_left` int NOT NULL,
  `free_places4_left` int NOT NULL,
  `free_places_left` int NOT NULL,
  `time_start` varchar(255) NOT NULL,
  `time_end` varchar(255) NOT NULL,
  `special_discount` int NOT NULL DEFAULT '0',
  `no_update` int NOT NULL,
  `description` text NOT NULL,
  `early_booking` tinyint DEFAULT '0',
  `best_city_cruise` int NOT NULL,
  `average_place_price` int NOT NULL,
  `update_places_time` int NOT NULL,
  `route_inserted` int NOT NULL,
  `free_places_true` int NOT NULL,
  `kr_route_eng` text NOT NULL,
  `kr_cities_eng` text NOT NULL,
  `infoflot_id` int NOT NULL,
  `seazon` int NOT NULL DEFAULT '0' COMMENT 'Сезонность круиза (1,2,3) - низкий, средний, высокий',
  `extra_place_price` int NOT NULL DEFAULT '0',
  `old_discount` int NOT NULL,
  `free_places_left_prev` int NOT NULL,
  `operator_link` varchar(255) NOT NULL,
  `price_includes` text NOT NULL,
  `offline_places` int NOT NULL,
  `updated_date` date NOT NULL,
  `kr_port` int NOT NULL DEFAULT '0',
  `port_prichal` varchar(255) NOT NULL,
  `cabin_1_minprice` int NOT NULL,
  `cabin_2_minprice` int NOT NULL,
  `cabin_3_minprice` int NOT NULL,
  `cabin_4_minprice` int NOT NULL,
  `special_note` varchar(255) NOT NULL,
  `black_friday` int NOT NULL DEFAULT '0',
  `other_discount` int NOT NULL,
  `season_id` varchar(255) NOT NULL COMMENT 'id сезонных скидок',
  `discount_offer_name` varchar(255) NOT NULL,
  `discount_offer_value` int NOT NULL,
  `discount_offer_priceincluded` int NOT NULL DEFAULT '1',
  `popular` int NOT NULL DEFAULT '0',
  `yandex_zen_link` varchar(250) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `cruis`
--

INSERT INTO `cruis` (`id`, `ship_id`, `kr_inner_id`, `provider_id`, `deleted`, `status_seazon_discount`, `alias`, `pagetitle`, `kr_name`, `kr_date_start`, `kr_date_end`, `kr_nights`, `kr_days`, `kr_weekend`, `kr_cities`, `kr_route`, `route_full`, `route_start`, `route_end`, `kr_url`, `kr_route_name`, `kr_region`, `kr_river`, `kr_surchage_meal_rub`, `kr_surcharge_excursions_rub`, `deleted_date`, `dt_start`, `dt_end`, `whiteswan_id`, `excursions`, `min_price`, `max_price`, `free_places1_left`, `free_places2_left`, `free_places3_left`, `free_places4_left`, `free_places_left`, `time_start`, `time_end`, `special_discount`, `no_update`, `description`, `early_booking`, `best_city_cruise`, `average_place_price`, `update_places_time`, `route_inserted`, `free_places_true`, `kr_route_eng`, `kr_cities_eng`, `infoflot_id`, `seazon`, `extra_place_price`, `old_discount`, `free_places_left_prev`, `operator_link`, `price_includes`, `offline_places`, `updated_date`, `kr_port`, `port_prichal`, `cabin_1_minprice`, `cabin_2_minprice`, `cabin_3_minprice`, `cabin_4_minprice`, `special_note`, `black_friday`, `other_discount`, `season_id`, `discount_offer_name`, `discount_offer_value`, `discount_offer_priceincluded`, `popular`, `yandex_zen_link`) VALUES
(10527, 2, '6897', 3, 1, 1, 0, '', '', '2006-09-20', '2007-09-20', 2, 2, 0, 'Ульяновск – Самара – Ульяновск', 'Ульяновск – Самара – Ульяновск', '', '', '', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-09-18 00:00:00', NULL, 0, NULL, 11200, 19200, 0, 3, 0, 0, 3, '05:00', '09:00', 0, 0, '', 0, 0, 11200, 1537203268, 0, 0, '', '', 0, 0, 0, 0, 3, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10529, 203, '5589', 4, 1, 1, 0, '', '', '2020-06-22', '2020-06-26', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-05-07 00:00:00', NULL, 0, NULL, 0, 0, 1, 21, 13, 14, 49, '17:30', '09:00', 0, 0, '', 0, 0, 30065, 1564645025, 0, 0, '', '', 0, 0, 0, 0, 49, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10533, 203, '5592', 4, 1, 1, 0, '', '', '2020-07-31', '2020-08-02', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-05-12 00:00:00', NULL, 0, NULL, 0, 0, 0, 6, 3, 2, 20, '17:30', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 20, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10536, 203, '5593', 4, 1, 1, 0, '', '', '2020-08-14', '2020-08-16', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-05-19 00:00:00', NULL, 0, NULL, 0, 0, 0, 8, 5, 1, 21, '17:30', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 21, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10541, 203, '5594', 4, 1, 1, 0, '', '', '2020-08-21', '2020-08-23', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-05-29 00:00:00', NULL, 0, NULL, 0, 0, 0, 13, 1, 3, 19, '17:30', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 19, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10542, 203, '5595', 4, 1, 1, 0, '', '', '2020-09-04', '2020-09-06', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-06-03 00:00:00', NULL, 0, NULL, 0, 0, 0, 11, 3, 0, 27, '17:30', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 27, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10544, 202, '5610', 4, 1, 1, 0, '', '', '2020-05-25', '2020-05-31', 6, 7, 0, 'Москва - Мышкин - Ярославль - Плёс - Кострома - Тутаев - Рыбинск - Коприно - Углич - Москва', 'Москва (Срв) - Мышкин - Ярославль - Плёс - Кострома - Тутаев - Рыбинск - Коприно - Углич - Москва (Срв)', 'Москва – Мышкин – Ярославль – Плес – Кострома – Тутаев – Рыбинск – Коприно – Углич – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-06-08 00:00:00', NULL, 0, NULL, 0, 0, 0, 0, 0, 0, 1, '10:00', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 1, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10545, 203, '5596', 4, 1, 1, 0, '', '', '2020-09-11', '2020-09-13', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-06-12 00:00:00', NULL, 0, NULL, 0, 0, 0, 28, 14, 7, 62, '17:30', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 62, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10547, 203, '5597', 4, 1, 1, 0, '', '', '2020-09-25', '2020-09-27', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-06-23 00:00:00', NULL, 0, NULL, 0, 0, 0, 26, 13, 1, 49, '17:30', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 49, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10553, 203, '5598', 4, 1, 1, 0, '', '', '2020-10-02', '2020-10-04', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-06-27 00:00:00', NULL, 0, NULL, 0, 0, 0, 0, 0, 0, -1, '17:30', '20:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, -1, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10560, 203, '5599', 4, 0, 1, 0, '', '', '2020-07-06', '2020-07-10', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-07-10 00:00:00', NULL, 0, NULL, 0, 0, 0, 17, 11, 13, 0, '17:30', '09:00', 0, 0, '', 0, 0, 31515, 1592563083, 0, 0, '', '', 0, 0, 0, 0, 0, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, 'Самый комфортабельный круиз по Оке!', 0, 0, '0', '', 0, 1, 0, NULL),
(10563, 203, '5600', 4, 1, 1, 0, '', '', '2020-07-13', '2020-07-17', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-07-17 00:00:00', NULL, 0, NULL, 0, 0, 1, 21, 13, 14, 49, '17:30', '09:00', 0, 0, '', 0, 0, 30065, 1564645026, 0, 0, '', '', 0, 0, 0, 0, 49, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10564, 203, '5601', 4, 1, 1, 0, '', '', '2020-07-20', '2020-07-24', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-07-23 00:00:00', NULL, 0, NULL, 0, 0, 0, 0, 0, 0, -1, '17:30', '09:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, -1, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10565, 203, '5602', 4, 1, 1, 0, '', '', '2020-07-27', '2020-07-31', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-07-27 00:00:00', NULL, 0, NULL, 0, 0, 0, 0, 0, 0, -1, '17:30', '09:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, -1, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10573, 203, '5605', 4, 1, 1, 0, '', '', '2020-08-10', '2020-08-14', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-08-06 00:00:00', NULL, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '17:30', '09:00', 0, 0, '', 0, 0, 0, 0, 0, 0, '', '', 0, 0, 0, 0, 0, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(10580, 203, '5606', 4, 0, 1, 0, '', '', '2020-08-17', '2020-08-21', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-08-23 00:00:00', NULL, 0, NULL, 0, 0, 0, 18, 12, 14, 0, '17:30', '09:00', 0, 0, '', 0, 0, 31759, 1594099922, 0, 0, '', '', 0, 0, 0, 0, 0, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, 'Самый комфортабельный круиз по Оке!', 0, 0, '0', '', 0, 1, 0, NULL),
(10585, 203, '5607', 4, 0, 1, 0, '', '', '2020-08-24', '2020-08-28', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-08-30 00:00:00', NULL, 0, NULL, 0, 0, 0, 17, 13, 14, 0, '17:30', '09:00', 0, 0, '', 0, 0, 31463, 1594105392, 0, 0, '', '', 0, 0, 0, 0, 0, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, 'Самый комфортабельный круиз по Оке!', 0, 0, '0', '', 0, 1, 0, NULL),
(10587, 203, '5608', 4, 0, 1, 0, '', '', '2020-08-31', '2020-09-04', 4, 5, 0, 'Москва - Константиново - Рязань - Коломна - Москва', 'Москва (Юрв) - Константиново - Рязань - Коломна - Москва (Юрв)', 'Москва – Константиново – Рязань – Коломна – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-09-04 00:00:00', NULL, 0, NULL, 0, 0, 0, 19, 12, 14, 0, '17:30', '09:00', 0, 0, '', 0, 0, 28700, 1594099923, 0, 0, '', '', 0, 0, 0, 0, 0, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, 'Самый комфортабельный круиз по Оке!', 0, 0, '0', '', 0, 1, 0, NULL),
(10589, 202, '5609', 4, 0, 1, 0, '', '', '2020-05-17', '2020-05-24', 7, 8, 0, 'Москва - Константиново - Рязань - Касимов - Муром - Нижний Новгород - Кострома - Ярославль - Мышкин - Углич - Москва', 'Москва (Юрв) - Константиново - Рязань - Касимов - Муром (Дивеево) - Нижний Новгород - Кострома - Ярославль - Мышкин - Углич - Москва (Срв)', 'Москва – Константиново – Рязань – Касимов – Муром – Нижний Новгород – Кострома – Ярославль – Мышкин – Углич – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', ' ', ' ', ' ', ' ', ' ', 1535319270, '2018-09-08 00:00:00', NULL, 0, NULL, 0, 0, 0, 4, 0, 1, 0, '10:00', '22:00', 0, 0, '', 0, 0, 52213, 1587973479, 0, 0, '', '', 0, 0, 0, 0, 0, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '2', '', 0, 1, 0, NULL),
(21978, 171, '17462', 2, 0, 1, 0, '', '', '2020-06-19', '2020-07-03', 13, 14, 0, 'Кострома - Астрахань - Кострома', 'Кострома - Астрахань - Кострома', 'Кострома – Астрахань – Кострома', 'Кострома', 'Кострома', 'Volgograd-Romanovskaya-Ilevka-Volgograd', '', '', '', '', '', 0, NULL, NULL, 0, NULL, 0, 0, 1, 3, 1, 1, 0, '16:00', '04:00', 0, 0, '', 0, 0, 48999, 1590516161, 0, 0, '', '', 0, 0, 0, 0, 0, 'https://gama-nn.ru/booking/river/7717/bhgbo/', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(21979, 171, '17463', 2, 0, 1, 0, '', '', '2020-06-20', '2020-07-02', 11, 12, 0, 'Нижний Новгород - Астрахань - Нижний Новгород', 'Нижний Новгород - Астрахань - Нижний Новгород', 'Нижний Новгород – Астрахань – Нижний Новгород', 'Нижний Новгород', 'Нижний Новгород', 'Volgograd-Romanovskaya-Ilevka-Volgograd', '', '', '', '', '', 0, NULL, NULL, 0, NULL, 0, 0, 3, 3, 5, 1, 0, '17:30', '06:00', 0, 0, '', 0, 0, 52333, 1591113959, 0, 0, '', '', 0, 0, 0, 0, 0, 'https://gama-nn.ru/booking/river/7718/knapxm/', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(21980, 171, '17464', 2, 1, 1, 0, '', '', '2021-08-19', '2021-08-20', 10, 1, 0, 'Нижний Новгород - Чебоксары', 'Нижний Новгород - Чебоксары', 'Нижний Новгород – Чебоксары', 'Нижний Новгород', 'Чебоксары', 'Volgograd-Romanovskaya-Ilevka-Volgograd', '', '', '', '', '', 0, NULL, NULL, 0, NULL, 0, 0, 0, 2, 0, 1, 0, '17:30', '06:30', 0, 0, '', 0, 0, 30160, 1591167750, 0, 0, '', '', 0, 0, 0, 0, 0, 'https://gama-nn.ru/booking/river/7719/sduaghid/', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(21981, 171, '17465', 2, 0, 1, 0, '', '', '2020-06-21', '2020-06-30', 8, 9, 0, 'Казань - Астрахань - Казань', 'Казань - Астрахань - Казань', 'Казань – Астрахань – Казань', 'Казань', 'Казань', 'Volgograd-Romanovskaya-Ilevka-Volgograd', '', '', '', '', '', 0, NULL, NULL, 0, NULL, 0, 0, 1, 2, 0, 2, 0, '17:30', '17:00', 0, 0, '', 0, 0, 34942, 1591117687, 0, 0, '', '', 0, 0, 0, 0, 0, 'https://gama-nn.ru/booking/river/7720/gwqluc/', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL),
(23007, 203, '5566', 4, 0, 1, 0, '', '', '2020-07-17', '2020-07-19', 2, 3, 0, 'Москва - Константиново - Москва', 'Москва (Юрв) - Константиново - Москва (Юрв)', 'Москва – Константиново – Москва', 'Москва', 'Москва', 'Volgograd-Romanovskaya-Ilevka-Volgograd', '', '', '', '', '', 0, NULL, NULL, 0, NULL, 0, 0, 1, 21, 13, 13, 0, '17:30', '20:00', 0, 0, '', 0, 0, 17735, 1593423250, 0, 0, '', '', 0, 0, 0, 0, 0, '', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, 'Самый комфортабельный круиз по Оке!', 0, 0, '0', '', 0, 1, 0, NULL),
(26780, 176, '18902', 2, 0, 1, 0, '', '', '2020-06-11', '2020-06-17', 5, 6, 0, 'Москва - Саратов', 'Москва - Саратов', 'Москва – Саратов', 'Москва', 'Саратов', '', '', '', '', '', '', 0, NULL, NULL, 0, NULL, 0, 0, 0, 0, 2, 0, 0, '19:30', '13:30', 0, 0, '', 0, 0, 15253, 1590548839, 0, 0, '', '', 0, 0, 0, 0, 0, 'https://gama-nn.ru/booking/river/9573/omscsos/', '', 0, '0000-00-00', 0, '', 0, 0, 0, 0, '', 0, 0, '0', '', 0, 1, 0, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cruis`
--
ALTER TABLE `cruis`
  ADD PRIMARY KEY (`id`),
  ADD KEY `ship_id` (`ship_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cruis`
--
ALTER TABLE `cruis`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42297;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
